{
  "_class_name": "DDPMScheduler",
  "_diffusers_version": "0.26.2",
  "beta_end": 2e-05,
  "beta_schedule": "linear",
  "beta_start": 1e-05,
  "clip_sample": true,
  "clip_sample_range": 1.0,
  "dynamic_thresholding_ratio": 0.995,
  "num_train_timesteps": 500,
  "prediction_type": "epsilon",
  "rescale_betas_zero_snr": false,
  "sample_max_value": 1.0,
  "steps_offset": 0,
  "thresholding": false,
  "timestep_spacing": "leading",
  "trained_betas": null,
  "variance_type": "fixed_large"
}
